var fdLocale = {
                fullMonths:["１月","２月","３月","４月","５月","６月","７月","８月","９月","10月","11月","12月"],
                monthAbbrs:["1月","2月","3月","4月","5月","6月","7月","8月","9月","10月","11月","12月"],
                fullDays:  ["月曜日","火曜日","水曜日","木曜日","金曜日","土曜日","日曜日"],
                dayAbbrs:  ["月","火","水","木","金","土","日"],
                titles:    ["先月","来月","去年","来年", "本日", "カレンダーを開く", "週", "週 [[%0%]] / [[%1%]]", "週", "日付を選択", "ドラッグで移動可能", "“[[%0%]]” を最初に表示", "本日へ", "日付非選択:"],
                firstDayOfWeek:0
};
try { datePickerController.loadLanguage(); } catch(err) {} 
