Repository: wocommunity/wonder
Catalog: Common/Frameworks/ERDirectToWeb/Resources/*.lproj/Localizable.strings
Languages: italian

# ERD2W.cancelCreationMessage
source: <b>Are you sure you want to stop creating this @@displayNameForEntity@@?</b><br><br>Clicking confirm will discard all your changes, Clicking Cancel will go back to editing your @@displayNameForEntity@@.
italian: <b>Sei sicuro di voler annullare la creazione di questo/a @@displayNameForEntity@@?</b><br><br>Cliccan sulla conferma per abbandonare le modifiche, Clicca su annulla per continuare le modifiche a @@displayNameForEntity@@.

# ERDDefaultCancelCreationMessageAssignment.cancelCreationMessage
source: <B>Are you sure you want to stop creating this @@displayNameForEntity@@?</B><br><br>Clicking confirm will discard all your changes, Clicking Cancel will go back to editing your @@displayNameForEntity@@.
italian: <b>Sei sicuro di voler annullare la creazione di questo/a @@displayNameForEntity@@?</b><br><br>Cliccan sulla conferma per abbandonare le modifiche, Clicca su annulla per continuare le modifiche a @@displayNameForEntity@@.

# ERDEditListButton.editButtonName
source: Edit @@displayNameForProperty@@ List
italian: Modifica l'elenco di @@displayNameForProperty@@

# ERDEmptyListMessage.emptyListMessage
source: <b>No matching @@displayNameForEntity@@ records found.</b>
italian: <b>Nessun record trovato.</b>

# ERDEmptyListMessage.emptyEmbeddedListMessage
source: <b>No matching @@displayNameForDestinationEntity@@ records found.</b>
italian: <b>Nessun record trovato.</b>

# ERDTrashcan.confirmDeletionMessage
source: <b>Are you sure you want to delete the following @@displayNameForEntity@@?</b>
italian: <b>Sei sicuro di voler eliminare questo/a @@displayNameForEntity@@?</b>

# ERDEditList.saveLabel
source: Save @@pluralCount@@ @@pluralString@@?
italian: Vuoi salvare @@pluralCount@@ @@pluralString@@?

# ERD2WEditToManyRelationship.noChoiceAvailable
source: No @@displayNameForEntity@@ available at this time
italian: Nessun/a @@displayNameForEntity@@ attualmente disponibile

# ERDEditDatePopupOrNull.none
source: None
italian: Nessuno

# ERDEditDatePopupOrNull.or
source: - or -
italian: - o -

# CouldNotSave
source: Could not save your changes: @@message@@
italian: Non posso salvare le modifiche: @@message@@

# CouldNotSavePleaseReapply
source: Could not save your changes. The @@displayNameForEntity@@ has changed in the database before you could save. Your changes have been lost. Please reapply them.
italian: Non posso salvare le modifiche. Il/la @@displayNameForEntity@@ risulta già modificato/a nel database. Le tue modifiche sono state scartate, inviale nuovamente.

# ERD2WInspect.alreadyAborted
source: <b>You already aborted this operation</b>. Please hit cancel and try again from the first step
italian: <b>Hai già annullato questa operazione</b>. Premi cancel e riprova dall'inizio.

# ERD2WList.confirmDeletionMessage
source: <b>Are you sure you want to delete the following @@displayNameForEntity@@?</b><br />@@object.userPresentableDescription@@
italian: <b>Sei sicuro di voler eliminare questo/a @@displayNameForEntity@@?</b><br />@@object.userPresentableDescription@@

# ERDEditStringWithChoices.noSelectionString
source: None
italian: Nessuna Selezione

# ERDInspect.objectUnsetMessage
source: No @@displayNameForDestinationEntity@@ set.
italian: Nessun @@displayNameForDestinationEntity@@ specificato.

# ERDInspect.select
source: Select...
italian: Seleziona...

# ERDQueryDateRangeJavaScript.and
source: and
italian: e

# ERDQueryDateRangeJavaScript.between
source: between
italian: fra

# ERDQueryTwoLevelRelationship.all
source: - all -
italian: - tutti/e -

source: is
italian: è

# like
source: is like
italian: è come

source: starts with
italian: inizia con
