Repository: wocommunity/wonder
Catalog: Frameworks/Core/ERDirectToWeb/Resources/*.lproj/ValidationTemplate.strings
Languages: german

# IllegalCharacterInNumberException
source: Please check the value <b>@@escapedValue@@</b> you supplied for the field <b>@@displayNameForProperty@@</b>.
german: Bitte überprüfen Sie den Wert <b>@@escapedValue@@</b> in <b>@@displayNameForProperty@@</b>.

# InvalidDateFormatException
source: Please check <b>@@displayNameForProperty@@</b> as <b>@@escapedValue@@</b> is not a valid date
german: Der Wert <b>@@escapedValue@@</b> in <b>@@displayNameForProperty@@</b> ist kein gültiges Datum.

# InvalidNumberException
source: The value is an invalid number.
german: Dieser Wert ist keine Zahl.

# MandatoryToManyRelationshipException
source: A <b>@@displayNameForEntity@@</b> must have a least one <b>@@displayNameForDestinationEntity@@</b>.
german: @@displayNameForProperty@@ müssen gesetzt sein.

# MandatoryToOneRelationshipException
source: A <b>@@displayNameForEntity@@</b> must have a <b>@@displayNameForProperty@@</b>.
german: @@displayNameForProperty@@ muss gesetzt sein.

# NotANumberException
source: Sorry, I could not read this number <b>@@escapedValue@@</b>
german: Der Wert <b>@@escapedValue@@</b> ist keine Zahl.

# NullPropertyException
source: Please provide @@indefiniteArticleForProperty@@ <b>@@displayNameForProperty@@</b>.
german: Bitte füllen Sie das Feld <b>@@displayNameForProperty@@</b> aus.

# ObjectCannotBeDeletedException
source: Cannot delete this <b>@@displayNameForEntity@@</b> because either this <b>@@displayNameForEntity@@</b> or any object related to this <b>@@displayNameForEntity@@</b> cannot be deleted.
german: Diese <b>@@displayNameForEntity@@</b> kann nicht gelöscht werden, weil Sie keine Rechte haben, diese <b>@@displayNameForEntity@@</b> direkt oder eines der verknüpften Objekte dieser <b>@@displayNameForEntity@@</b> zu löschen.

# ObjectRemovalException
source: Cannot delete this <b>@@displayNameForEntity@@</b>. You should first delete the item in its <b>@@displayNameForProperty@@</b>.
german: <b>@@displayNameForEntity@@</b> kann nicht gelöscht werden löschen, solange noch <b>@@displayNameForProperty@@</b> gesetzt sind.

# ObjectsRemovalException
source: Cannot delete this <b>@@displayNameForEntity@@</b>. You should first delete the items in its <b>@@displayNameForProperty@@</b>.
german: <b>@@displayNameForEntity@@</b> kann nicht gelöscht werden löschen, solange noch <b>@@displayNameForProperty@@</b> gesetzt sind.

# PasswordsDontMatchException
source: The <b>passwords</b> you entered don't match
german: Die <b>Passworte</b> stimmen nicht überein.

# PasswordsFillBothFieldsException
source: Please fill in both <b>password</b> fields
german: Bitte füllen Sie beide <b>Passwort</b> Felder aus.
